templates/cves/CVE-2021-38647.yaml

id: CVE-2021-38647
name: "Microsoft OMIGOD - Azure OMI RCE"
severity: critical
description: "Microsoft Open Management Infrastructure (OMI) allows unauthenticated remote code execution via specially crafted SOAP requests."
reference: CWE-287
confidence: tentative
requests:
  - method: POST
    path: "/wsman"
    headers:
      Content-Type: "application/soap+xml;charset=UTF-8"
    body: '<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><p:OperationTimeout xmlns:p="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">PT60.000S</p:OperationTimeout></s:Header><s:Body><p:Identify xmlns:p="http://schemas.dmtf.org/wbem/wsman/identity/1/wsmanidentity.xsd"/></s:Body></s:Envelope>'
    matchers:
      - type: body
        words:
          - "OMI"
          - "ProductVersion"
      - type: status
        status: [200]
    condition: and
